In [1]:
print("Hello World!")

Hello World!

In [2]:
import pandas as pd

In [3]:
path_name = '/Users/amirejibiilia/Desktop/mAIa/Test_data.xlsx'
data = pd.read_excel(path_name, engine='openpyxl')
data

                           metrics       year     value
0           income from production 2024-01-01    127.12
1           income from production 2024-01-01    270.35
2           income from production 2024-01-01   3406.78
3           income from production 2024-01-01  67276.27
4           income from production 2024-02-01     90.03
..                             ...        ...       ...
300  income from technical service 2024-10-01    533.89
301  income from technical service 2024-11-01    296.61
302  income from technical service 2024-11-01    330.51
303  income from technical service 2024-12-01    254.24
304  income from technical service 2024-12-01    355.93

[305 rows x 3 columns]

In [21]:
def query_data(data: pd.DataFrame, where: dict = None, group_by: list = None, 
               aggregations: dict = None, order_by: list = None) -> pd.DataFrame:
    """Main function that ties together all the SQL-like operations."""
    # Convert 'year' column to datetime if not already
    if 'year' in data.columns and not pd.api.types.is_datetime64_any_dtype(data['year']):
        data['year'] = pd.to_datetime(data['year'], format='%d.%m.%y')
    
    # Apply operations step by step
    data = apply_where(data, where)
    data = group_and_aggregate(data, group_by, aggregations)
    data = apply_order_by(data, order_by)
    
    return data

# def apply_where(data: pd.DataFrame, where: dict) -> pd.DataFrame:
#     """Applies WHERE conditions to the DataFrame."""
#     if where:
#         for column, condition in where.items():
#             for operator, value in condition.items():
#                 # Convert value to datetime only if it's a valid date string
#                 if isinstance(value, str) and ('.' in value or '-' in value):  # Check if it's a date-like string
#                     value = pd.to_datetime(value, format='%d.%m.%y', errors='coerce')  # Use 'coerce' to handle invalid dates
#                 if operator == '>=':
#                     data = data[data[column] >= value]
#                 elif operator == '<':
#                     data = data[data[column] < value]
#                 elif operator == '=':
#                     data = data[data[column] == value]
#                 elif operator == '!=':
#                     data = data[data[column] != value]
#                 elif operator == '<=':
#                     data = data[data[column] <= value]
#                 elif operator == '>':
#                     data = data[data[column] > value]
#     return data

def apply_where(data: pd.DataFrame, where: dict) -> pd.DataFrame:
    """Applies WHERE conditions to the DataFrame."""
    if where:
        for column, condition in where.items():
            for operator, value in condition.items():
                # Convert value to datetime if the column is 'year' (or any datetime column)
                if column == "year" and isinstance(value, str):  
                    value = pd.to_datetime(value, format='%Y-%m-%d', errors='coerce')  
                    
                if operator == '>=':
                    data = data[data[column] >= value]
                elif operator == '<':
                    data = data[data[column] < value]
                elif operator == '=':
                    data = data[data[column] == value]
                elif operator == '!=':
                    data = data[data[column] != value]
                elif operator == '<=':
                    data = data[data[column] <= value]
                elif operator == '>':
                    data = data[data[column] > value]
    return data

def group_and_aggregate(data: pd.DataFrame, group_by: list, aggregations: dict) -> pd.DataFrame:
    """Groups the DataFrame by specified columns and applies aggregations, renaming the resulting columns."""
    if group_by:
        data = data.groupby(group_by, as_index=False).agg(aggregations)
    
    # Rename columns to match SQL-style SELECT aliases
    new_columns = []
    for col in data.columns:
        if isinstance(col, tuple):  # Multi-index columns from aggregation
            new_columns.append(f"{col[0]}_{col[1]}")  # Example: 'Sales_sum'
        else:
            new_columns.append(col)  # Keep original column name

    data.columns = new_columns  # Assign new column names
    return data

def apply_order_by(data: pd.DataFrame, order_by: list) -> pd.DataFrame:
    """Applies ORDER BY sorting to the DataFrame."""
    if order_by:
        for col, ascending in order_by:
            if isinstance(data, pd.DataFrame):  # Check if it's a DataFrame
                data = data.sort_values(by=col, ascending=ascending)
    return data

def execute_query(query_json: dict) -> pd.DataFrame:
    """
    Executes the query by receiving the general JSON-like object with all query parameters.
    The query_json structure should include 'data', 'where', 'group_by', 'aggregations', and 'order_by'.
    """
    # Extract parameters from the provided JSON object
    data = query_json.get("data")
    where = query_json.get("where")
    group_by = query_json.get("group_by")
    aggregations = query_json.get("aggregations")
    order_by = query_json.get("order_by")
    
    # Call query_data with the parameters extracted from the JSON-like object
    result = query_data(data, 
                        where=where, 
                        group_by=group_by, 
                        aggregations=aggregations, 
                        order_by=order_by)
    
    return result

In [22]:
data.head()

                  metrics       year     value
0  income from production 2024-01-01    127.12
1  income from production 2024-01-01    270.35
2  income from production 2024-01-01   3406.78
3  income from production 2024-01-01  67276.27
4  income from production 2024-02-01     90.03

In [31]:
query_json = {
    "data": data,
#     "where": {
#         "metrics": {"=": "income from production"}
#     },
    "group_by": ["metrics"],
    "aggregations": {"value": ["sum"]},
    "order_by": [("value_sum", False)]  # Sort by total value descending
}

result_df = execute_query(query_json)
result_df

                        metrics_   value_sum
1            income from service  1427244.36
2            income from tabloes   249254.22
0         income from production   227613.38
3  income from technical service     8385.58

In [36]:
query_json = { "data": data, 
              "where": { "metrics": {"=": "income from production"} }, 
              "group_by": ["year"], 
              "aggregations": {"value": ["sum"]}, 
              "order_by": [("value_sum", False)] }

In [40]:
query_json = { "data": data , "where": { "metrics": {"=": "income from production"} }, "group_by": ["year"], "aggregations": {"value": ["sum"]}, "order_by": [("value_sum", False)] }

In [41]:
result_df = execute_query(query_json)
result_df

        year_  value_sum
0  2024-01-01   71080.52
1  2024-02-01   43466.30
7  2024-08-01   32911.24
9  2024-10-01   19954.26
5  2024-06-01   14975.41
3  2024-04-01   10566.46
8  2024-09-01    9538.45
6  2024-07-01    8490.26
2  2024-03-01    7184.68
10 2024-11-01    4422.33
11 2024-12-01    3150.02
4  2024-05-01    1873.45